//******************************************************************************
//include
//******************************************************************************
#include "MovingAverage.h"
#include <stdint.h>
//******************************************************************************
// Секция определения констант
//******************************************************************************

//******************************************************************************
// Секция определения переменных, используемых в модуле
//******************************************************************************
//------------------------------------------------------------------------------
// Глобальные
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Локальные
//------------------------------------------------------------------------------
MovingAverage_t mv[MvAv_NUM_CHANNEL] = {0};
//******************************************************************************
// Секция прототипов локальных функций
//******************************************************************************
 
//******************************************************************************
// Секция описания функций
//******************************************************************************
// Добавляем новый элемент в буфер
void MovingAverage_AddSample(uint8_t channel, float value)
{
    if(channel >= MvAv_NUM_CHANNEL) return;

    MovingAverage_t* filt = &mv[channel];

    filt->buffer[filt->index++] = value;

    if(filt->count < 255)
        filt->count++;
}
//------------------------------------------------------------------------------
float MovingAverage_Calc(uint8_t channel, uint8_t nAvg)
{
    if(channel >= MvAv_NUM_CHANNEL) return 0.0f;
    if(nAvg == 0) nAvg = 1;

    MovingAverage_t* filt = &mv[channel];
    if(filt->count == 0) return 0.0f;
    
    uint8_t index = filt->index - 1;        //Индекс последнего элемента
    uint8_t nAvg_ = (nAvg > filt->count) ? filt->count : nAvg;
    uint8_t cntAvg = nAvg_;
      
    double sum = 0.0;
    do
    {
      // начинаем с последнего записанного элемента и идём "назад" по окну
      sum += (double)filt->buffer[index--];
    }
    while(--cntAvg);
    
    sum /= (double)nAvg_;

    return (float)sum;
}
