#pragma once
//******************************************************************************
// Секция include
//******************************************************************************
#include<stdint.h>

#ifdef __cplusplus
extern "C" {
#endif
//******************************************************************************
// Секция определения констант
//******************************************************************************
#define INA226_COUNT 4
//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef enum 
{
  TYPE_RSHUNT,
  TYPE_CURRENT_LSB,
  TYPE_ADDRESS,
  TYPE_OUT_DIVIDER,
  TYPE_DOWNSAMPLE,
  TYPE_AVG_WINDOW_SIZE,
}ParamType_t;

#pragma pack(4)          // выравнивание на 4 байта
typedef struct 
{
  uint8_t INA226_Addr[INA226_COUNT];
  float Rshunt_INA226[INA226_COUNT];
  float Current_LSB_INA226[INA226_COUNT];
  uint32_t OutDivider[INA226_COUNT];
  uint32_t dataDownsampleFactor;
  uint8_t avgWindowSize[INA226_COUNT];
}Parameters_t;
#pragma pack()   
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void CurrentMonitorInit(void);
void CurrentMonitorProcess(void);
void GetParameters(void* param, ParamType_t type);
//******************************************************************************
// Секция определения макросов
//******************************************************************************

#ifdef __cplusplus
}
#endif