#ifndef FLASH_STORE_H
#define FLASH_STORE_H
//******************************************************************************
// Секция include
//******************************************************************************
#include "stm32f4xx_hal.h"
#include <stddef.h>
#include <stdint.h>
//******************************************************************************
// Секция определения констант
//******************************************************************************

//******************************************************************************
// Секция определения типов
//******************************************************************************

//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void FlashStore_Init(void);

uint32_t FlashStore_GetPageSize(void);      // размер страницы/сектора
uint32_t FlashStore_GetLastPageAddr(void);  // адрес последнего сектора/страницы
uint32_t FlashStore_GetLastPageIndex(void); // номер сектора/страницы

HAL_StatusTypeDef FlashStore_WriteParams(void* param, size_t size);
void FlashStore_ReadParams(void* param, size_t size);

void FlashStore_Clear(void);
//******************************************************************************
// Секция определения макросов
//******************************************************************************
#endif