#ifndef I2C1_H
#define I2C1_H
//******************************************************************************
// Секция include
//******************************************************************************
#include <stdint.h>
#include <stddef.h>

#ifdef __cplusplus
extern "C" {
#endif

//******************************************************************************
// Секция определения констант
//******************************************************************************

//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef enum {
    I2C1_OK = 0,
    I2C1_TX_CPLT,
    I2C1_RX_CPLT,
    I2C1_ERR,
}i2c1_ret_t;
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
typedef void (*i2c_callback_t)(i2c1_ret_t status);
void I2C1_Init(void);
i2c1_ret_t I2C1_Write(uint8_t addr7bit, const uint8_t *data, size_t len, uint32_t timeout_ms);
i2c1_ret_t I2C1_Read(uint8_t addr7bit, uint8_t *data, size_t len, uint32_t timeout_ms);
i2c1_ret_t I2C1_Write_IT(uint8_t addr7bit, const uint8_t *data, size_t len);
i2c1_ret_t I2C1_Read_IT(uint8_t addr7bit, uint8_t *data, size_t len);
void I2C1_SetCallback(i2c_callback_t cb);

#ifdef __cplusplus
}
#endif

#endif