#ifndef INA226_H
#define INA226_H
//******************************************************************************
// Секция include
//******************************************************************************
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

//******************************************************************************
// Секция определения констант
//******************************************************************************
#define INA226_COUNT 4
#define INA226_I2C_TIMEOUT_MS 100
//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef struct {
    float bus_voltage;   // Вольты
    float current;       // Амперы
    float power;         // Ватты
} INA226_Data;

typedef enum 
{
    INA226_OK = 0,
    INA226_ERR,
    INA226_TIMEOUT,
    INA226_CPLT
} ina226_status_t; // Статус последней операции
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void INA226_Init(void);   // Инициализация всех INA226
int INA226_SetCalibration(const uint8_t *addr, const float *rshunt, const float *current_lsb); // Установка калибровки для всех INA226
void INA226_start_reade(void) ;// Начать опрос всех INA226 в неблокирующем режиме
ina226_status_t INA226_get_status(void) ; // Получить статус последней операции
void INA226_ReadCurrents(float* current_); // Прочитать текущие токи
void INA226_ReadCurrents_na(uint32_t* current_);

#ifdef __cplusplus
}
#endif

#endif // INA226_H