#ifndef MOIVING_AVERAGE_H
#define MOIVING_AVERAGE_H
//******************************************************************************
// Секция include
//******************************************************************************
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif
//******************************************************************************
// Секция определения констант
//******************************************************************************
#define MvAv_NUM_CHANNEL 4
//******************************************************************************
// Секция определения типов
//******************************************************************************
typedef struct
{    
  float buffer[256];
  uint8_t index;   // Текущий индекс вставки
  uint8_t count;   // Количество заполненных элементов (для первых N семплов)
} MovingAverage_t;
//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************

//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void MovingAverage_AddSample(uint8_t channel, float value);
float MovingAverage_Calc(uint8_t channel, uint8_t nAvg);
#ifdef __cplusplus
}
#endif

#endif