#ifndef SERIAL_PROTOCOL_H
#define SERIAL_PROTOCOL_H
//******************************************************************************
// Секция include
//******************************************************************************
#include "CurrentMonitor.h"

#ifdef __cplusplus
extern "C" {
#endif
//******************************************************************************
// Секция определения констант
//******************************************************************************

//******************************************************************************
// Секция определения типов
//******************************************************************************

//******************************************************************************
// Секция определения глобальных переменных
//******************************************************************************
typedef void (*SerialProtocol_UpdateCallback)(void* param, ParamType_t type);
//******************************************************************************
// Секция прототипов глобальных функций
//******************************************************************************
void InitSerialProtocol(SerialProtocol_UpdateCallback cb);
void TransmiteCurrent_double(double* currents);
void TransmiteCurrent_uint(uint32_t* currents);
void SerialProcess(void);
#ifdef __cplusplus
}
#endif

#endif